Диплом/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Диплом/src/Enums/ВКМ_КатегорииСотрудников/ВКМ_КатегорииСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВКМ_КатегорииСотрудников</name>
  <enumValues>
    <name>АдминистративныйПерсонал</name>
  </enumValues>
  <enumValues>
    <name>Специалисты</name>
  </enumValues>
</mdclass:Enum>

Диплом/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	ЗаблокроватьПроцент();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	ЗаблокроватьПроцент();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаблокроватьПроцент()
	Если Запись.Сотрудник.Категория = Перечисления.ВКМ_КатегорииСотрудников.АдминистративныйПерсонал тогда
		Запись.ПроцентОтРабот = 0;
		ЭтаФорма.Элементы.ПроцентОтРабот.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры	
#КонецОбласти
